/**
 * Это файл для структуры интеграционного события, которое поступает из другой системы.
 * Сообщение содержит данные о тикете, но не содержит явного указания события/событий.
 * Событие/список событий определяется по данным из сообщения и данным в БД.
 * Например: если сообщение содержит тикет, которого нет в БД - это новая заявка.
 * Если сообщение содержит тикет, который уже есть в БД, то значит это обновление.
 * Какие поля нужно обновлять - это вычисляется по результату сравнения значений 
 * полей в БД и в сообщении.
 * 
 * Структура сообщения:
 *  
 */

